# Pyber Challenge

### 4.3 Loading and Reading CSV files

In [2]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

# File to Load (Remember to change these)
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

# Read the City and Ride Data
city_data_df = pd.read_csv(city_data_to_load)
ride_data_df = pd.read_csv(ride_data_to_load)

In [3]:
# show first 10 rows of city_data_df
city_data_df.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [4]:
# show first 10 rows of ride_data_df
ride_data_df.head(10)

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344
5        South Latoya  2019-03-11 12:26:48   9.52  1994999424437
6       New Paulville  2019-02-27 11:17:56  43.25   793208410091
7        Simpsonburgh  2019-04-26 00:43:24  35.98   111953927754
8     South Karenland  2019-01-08 03:28:48  35.09  7995623208694
9       North Jasmine  2019-03-09 06:26:29  42.81  5327642267789

### Merge the DataFrames

In [5]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the data table for preview
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

## Deliverable 1: Get a Summary DataFrame

In [6]:
#  1. Get the total rides for each city type

# A. Create DataFrame for each type of city
urban_cities_df = pyber_data_df[pyber_data_df["type"] == "Urban"]
suburban_cities_df = pyber_data_df[pyber_data_df["type"] == "Suburban"]
rural_cities_df = pyber_data_df[pyber_data_df["type"] == "Rural"]

#B. Get the number of rides for urban cities.
sum_urban_ride_count = urban_cities_df.count()["ride_id"]

#C. Get number of rides for suburban cities.
sum_suburban_ride_count = suburban_cities_df.count()["ride_id"]

#D. Get number of rides for rural cities (which is an oxymoron).
sum_rural_ride_count = rural_cities_df.count()["ride_id"]

# Print results so I feel better 
print (sum_urban_ride_count, sum_suburban_ride_count, sum_rural_ride_count)

1625 625 125

In [7]:
# 2. Get the total drivers for each city type
sum_drivers_urban = city_data_df[city_data_df["type"] == "Urban"].sum()["driver_count"]
sum_drivers_suburban = city_data_df[city_data_df["type"] == "Suburban"].sum()["driver_count"]
sum_drivers_rural = city_data_df[city_data_df["type"] =="Rural"].sum()["driver_count"]

# Print results so I feel better 
print(sum_drivers_urban, sum_drivers_suburban, sum_drivers_rural)

2405 490 78

In [8]:
#  3. Get the total amount of fares for each city type
sum_fares_urban = (round(urban_cities_df.sum()["fare"],2))
sum_fares_suburban = (round(suburban_cities_df.sum()["fare"],2))
sum_fares_rural = (round(rural_cities_df.sum()["fare"],2))

# Print results so I feel better 
print(sum_fares_urban, sum_fares_suburban, sum_fares_rural)

39854.38 19356.33 4327.93

In [9]:
#  4. Get the average fare per ride for each city type. 
urban_avg_fare = (round(urban_cities_df.mean()["fare"],2))
suburban_avg_fare = (round(suburban_cities_df.mean()["fare"],2))
rural_avg_fare = (round(rural_cities_df.mean()["fare"],2))

# Print results so I feel better 
print(urban_avg_fare ,suburban_avg_fare, rural_avg_fare)

24.53 30.97 34.62

C:\Users\Mother\anaconda3\envs\pythondata\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.

C:\Users\Mother\anaconda3\envs\pythondata\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  This is separate from the ipykernel package so we can avoid doing imports until
C:\Users\Mother\anaconda3\envs\pythondata\lib\site-packages\ipykernel_launcher.py:4: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  after removing the cwd from sys.path.

In [10]:
# 5. Get the average fare per driver for each city type. 
urban_avg_fare_per_driver = (round(sum_fares_urban / sum_drivers_urban, 2))
suburban_avg_fare_per_driver = (round(sum_fares_suburban / sum_drivers_suburban,2))
rural_avg_fare_per_driver = (round(sum_fares_rural / sum_drivers_rural,2))

# Print results so I feel better 
print(urban_avg_fare_per_driver, suburban_avg_fare_per_driver, rural_avg_fare_per_driver)

16.57 39.5 55.49

In [16]:
#  6. Create a PyBer summary DataFrame. 

pyber_data_df.describe()

              fare       ride_id  driver_count
count  2375.000000  2.375000e+03   2375.000000
mean     26.753112  4.887270e+12     28.930105
std      12.109465  2.907361e+12     20.666306
min       4.050000  3.218337e+08      1.000000
25%      17.190000  2.381175e+12     11.000000
50%      26.600000  4.748541e+12     23.000000
75%      36.645000  7.461936e+12     45.000000
max      58.550000  9.991538e+12     73.000000

In [17]:
ride_data_df.describe()

              fare       ride_id
count  2375.000000  2.375000e+03
mean     26.753112  4.887270e+12
std      12.109465  2.907361e+12
min       4.050000  3.218337e+08
25%      17.190000  2.381175e+12
50%      26.600000  4.748541e+12
75%      36.645000  7.461936e+12
max      58.550000  9.991538e+12

In [15]:
#summary of urban_cities_df
urban_cities_df.describe()

              fare       ride_id  driver_count
count  1625.000000  1.625000e+03   1625.000000
mean     24.525772  4.873485e+12     36.678154
std      11.738649  2.907440e+12     20.075545
min       4.050000  1.458810e+10      3.000000
25%      14.550000  2.400244e+12     22.000000
50%      24.640000  4.711188e+12     37.000000
75%      34.580000  7.451579e+12     52.000000
max      44.970000  9.991538e+12     73.000000

In [12]:
#summary of suburban_cities_df
suburban_cities_df.describe()

             fare       ride_id  driver_count
count  625.000000  6.250000e+02    625.000000
mean    30.970128  4.971015e+12     13.712000
std     10.677508  2.912410e+12      8.042372
min     12.050000  3.218337e+08      1.000000
25%     21.970000  2.364253e+12      5.000000
50%     30.750000  5.053221e+12     16.000000
75%     39.830000  7.551674e+12     21.000000
max     49.960000  9.917744e+12     25.000000

In [13]:
#summary of rural_cities_df
rural_cities_df.describe()

             fare       ride_id  driver_count
count  125.000000  1.250000e+02    125.000000
mean    34.623440  4.647746e+12      4.296000
std     14.558046  2.887834e+12      2.691156
min     10.110000  2.684873e+10      1.000000
25%     19.900000  2.275364e+12      1.000000
50%     37.050000  4.023962e+12      4.000000
75%     47.070000  7.118047e+12      7.000000
max     58.550000  9.990581e+12      9.000000

In [9]:
#  7. Cleaning up the DataFrame. Delete the index name
pyber_summary_df.index.name = None

In [10]:
#  8. Format the columns.

## Deliverable 2.  Create a multiple line plot that shows the total weekly of the fares for each type of city.

In [11]:
# 1. Read the merged DataFrame

In [12]:
# 2. Using groupby() to create a new DataFrame showing the sum of the fares 
#  for each date where the indices are the city type and date.

In [13]:
# 3. Reset the index on the DataFrame you created in #1. This is needed to use the 'pivot()' function.
# df = df.reset_index()

In [14]:
# 4. Create a pivot table with the 'date' as the index, the columns ='type', and values='fare' 
# to get the total fares for each type of city by the date.

In [15]:
# 5. Create a new DataFrame from the pivot table DataFrame using loc on the given dates, '2019-01-01':'2019-04-29'.

In [16]:
# 6. Set the "date" index to datetime datatype. This is necessary to use the resample() method in Step 8.
# df.index = pd.to_datetime(df.index)

In [17]:
# 7. Check that the datatype for the index is datetime using df.info()

In [18]:
# 8. Create a new DataFrame using the "resample()" function by week 'W' and get the sum of the fares for each week.

In [19]:
# 8. Using the object-oriented interface method, plot the resample DataFrame using the df.plot() function. 

# Import the style from Matplotlib.
from matplotlib import style
# Use the graph style fivethirtyeight.
style.use('fivethirtyeight')